In [25]:
import numpy as np
import pandas as pd
traindata=pd.read_csv("TitanicTrain.csv",delimiter=",")
testdata=pd.read_csv("TitanicTest.csv",delimiter=",")

In [26]:
traindata.shape

(668, 11)

In [27]:
testdata.shape

(223, 10)

In [28]:
traindata.isna().sum()           #From the output we can see that Age,Cabin and Embarked column have null values
                                 #cabin has a lot of null values almost 90 percent so I will drop the column

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [29]:
meanage=traindata['Age'].mean()                             #Replacing NAN Values of Age by mean value of Age column
traindata['Age'].fillna(meanage,inplace=True)

In [30]:
traindata.drop('Cabin',axis=1,inplace=True)

In [31]:
male=pd.get_dummies(traindata['Sex'],drop_first=True)

In [32]:
traindata['Male']=male

In [33]:
traindata.drop(['Name','Sex','Ticket','Embarked'],axis=1,inplace=True)   
#Dropping Name,Ticket,Embarked as it contains string vals.Instead of sex vals a Male col is used where 1 =Male & 0=Female

In [34]:
traindata.isna().sum()   #Now our training data is free of any null values

Pclass      0
Age         0
SibSp       0
Parch       0
Fare        0
Survived    0
Male        0
dtype: int64

In [37]:
train_x=traindata.drop('Survived',axis=1)
train_y=traindata['Survived']

In [42]:
testdata.shape

(223, 10)

In [43]:
testdata.isna().sum()

Pclass        0
Name          0
Sex           0
Age          45
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       173
Embarked      1
dtype: int64

In [44]:
testdata['Age'].fillna(testdata['Age'].mean(),inplace=True)  #Replacing NAN Values of Age by mean value of Age column

In [46]:
maletest=pd.get_dummies(testdata['Sex'],drop_first=True)
testdata['Male']=maletest

In [48]:
testdata.drop(['Name','Sex','Ticket','Embarked'],axis=1,inplace=True)
testdata

     Pclass        Age  SibSp  Parch      Fare Cabin  Male
0         2   8.000000      1      1   36.7500   NaN     1
1         1  49.000000      0      0   25.9292   D17     0
2         3  29.694775      0      0    7.7375   NaN     1
3         2  24.000000      2      1   27.0000   NaN     0
4         1  36.000000      0      0   26.2875   E25     1
..      ...        ...    ...    ...       ...   ...   ...
218       3  20.000000      1      0    7.9250   NaN     1
219       1  45.000000      0      0   26.5500   B38     1
220       1  17.000000      1      0  108.9000   C65     0
221       3  43.000000      0      0    6.4500   NaN     1
222       2  36.500000      0      2   26.0000    F2     1

[223 rows x 7 columns]

In [49]:
testdata.drop('Cabin',axis=1,inplace=True)
testdata

     Pclass        Age  SibSp  Parch      Fare  Male
0         2   8.000000      1      1   36.7500     1
1         1  49.000000      0      0   25.9292     0
2         3  29.694775      0      0    7.7375     1
3         2  24.000000      2      1   27.0000     0
4         1  36.000000      0      0   26.2875     1
..      ...        ...    ...    ...       ...   ...
218       3  20.000000      1      0    7.9250     1
219       1  45.000000      0      0   26.5500     1
220       1  17.000000      1      0  108.9000     0
221       3  43.000000      0      0    6.4500     1
222       2  36.500000      0      2   26.0000     1

[223 rows x 6 columns]

In [75]:
from sklearn.model_selection import train_test_split
Xtrain,Xtest,Ytrain,Ytest=train_test_split(train_x,train_y,random_state=1)

In [102]:
from sklearn.linear_model import LogisticRegression
alg=LogisticRegression(solver='saga',penalty='l2',max_iter=10000)
alg.fit(Xtrain,Ytrain)

LogisticRegression(max_iter=10000, solver='saga')

In [77]:
pred=alg.predict(Xtest)

In [87]:
pred1=pred.reshape(-1,1)
Ytest1=Ytest.to_numpy().reshape(-1,1)

In [89]:
alg.score(Xtest,pred1)

1.0

In [90]:
predtest=alg.predict(testdata)

In [91]:
predtest

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [95]:
np.savetxt("titaniclog.csv",predtest,fmt='%i')

In [103]:
alg.fit(train_x,train_y)

LogisticRegression(max_iter=10000, solver='saga')

In [104]:
pred2=alg.predict(testdata)
pred2

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [105]:
np.savetxt("titaniclog1.csv",pred2,fmt='%i')